In [1]:
people = {
    "first": ["Karthik", 'Ajith', 'Moni'], 
    "last": ["Raja", 'Dheiva', 'Singh'], 
    "email": ["KarthikRaja@gmail.com", 'AjithDheiva@email.com', 'MoniSingh@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df.head()

     first    last                  email
0  Karthik    Raja  KarthikRaja@gmail.com
1    Ajith  Dheiva  AjithDheiva@email.com
2     Moni   Singh    MoniSingh@email.com

In [5]:
df['email']

0    KarthikRaja@gmail.com
1    AjithDheiva@email.com
2      MoniSingh@email.com
Name: email, dtype: object

In [6]:
df.email

0    KarthikRaja@gmail.com
1    AjithDheiva@email.com
2      MoniSingh@email.com
Name: email, dtype: object

In [7]:
df[['email', 'first']]

                   email    first
0  KarthikRaja@gmail.com  Karthik
1  AjithDheiva@email.com    Ajith
2    MoniSingh@email.com     Moni

In [8]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

### iloc

In [9]:
df.iloc[1]

first                    Ajith
last                    Dheiva
email    AjithDheiva@email.com
Name: 1, dtype: object

In [10]:
df.iloc[[1,0]]

     first    last                  email
1    Ajith  Dheiva  AjithDheiva@email.com
0  Karthik    Raja  KarthikRaja@gmail.com

In [11]:
df.iloc[[1,0],1]

1    Dheiva
0      Raja
Name: last, dtype: object

In [12]:
df.iloc[[1,0],[1, 0]]

     last    first
1  Dheiva    Ajith
0    Raja  Karthik

### loc

In [13]:
df.head()

     first    last                  email
0  Karthik    Raja  KarthikRaja@gmail.com
1    Ajith  Dheiva  AjithDheiva@email.com
2     Moni   Singh    MoniSingh@email.com

In [14]:
df.loc[2]

first                   Moni
last                   Singh
email    MoniSingh@email.com
Name: 2, dtype: object

In [15]:
df.loc[[2,0]]

     first   last                  email
2     Moni  Singh    MoniSingh@email.com
0  Karthik   Raja  KarthikRaja@gmail.com

In [16]:
df.loc[[2,0], 'last']

2    Singh
0     Raja
Name: last, dtype: object

In [17]:
df.loc[[2,0], ['last', 'email']]

    last                  email
2  Singh    MoniSingh@email.com
0   Raja  KarthikRaja@gmail.com